import React from 'react'
import radeKonchar from "../Images/radeKonchar.svg"
import Image from 'next/image'
const ZaNasRade = () => {
    
  return (
    <>
    <div className="row justify-content-between mt-5 rade-container ">
        
        <div className="col-5 ">
    <h3 className='text-align-left font-weight-extrabold mb-5'>Раде Јовчевски – Корчагин (1919-1943)</h3>
    <h4 className='text-align-left font-weight-extrabold mb-5'>Народен Херој</h4>
    <p className='text-align-left mt-2'>Раде Јовчевски бил роден на 14 август 1919 година во Скопје во скромно занаетчиско семејство. Неговиот татко Коста бил познат скопски чевлар. Своето основно образование Раде го започнал во месното скопско училиште и бил солиден ученик. Иако Раде сакал да го продолжи своето образование, сепак поради сиромаштијата тоа не му било овозможено и морал да почен да изучува занает. Раде Јовчевски се помирил со тоа и решил да почне да изучува некој занает кој ќе биде поплатен и постабилен од тој на татко му. Така, во 1933 година почнал да го посетува училиштето за трговска младина како кожарски работник. Корчагин работел и изучувал занает цели три години, но откако завршил со обуката тој не нашол работа во Скопје. Поради тоа, Раде Корчагин заминал за Белград. Таму нашол работа по занает и се зачленил во кожарскиот и крзнениот синдикат. Тогаш се стекнал и со прекарот „Корчагин“, по јунакот во романот „Како се калеше челикот“ од Николај Островски Бидејќи се покажал како вреден и одлучен човек, Раде Корчагин бил назначен за секретар на синдикатот во 1938 година, а веќе во 1939 година станал и член на Комунистичката партија на Југославија.</p>
        </div>
        <div className="col-5 ">
        <Image src={radeKonchar} alt="rade" width={600}
            height={600}
            style={{maxWidth: "100%",
            height:"`100%`"}}  ></Image>
        </div>
    </div>
        
    </>
  )
}

export default ZaNasRade
